#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-cognito/runs/run-yAaGBbB676btRZyZ

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_cognito_user_pool_domain.dev: Refreshing state... [id=dev-user-pool]
aws_cognito_user_pool.test: Refreshing state... [id=ca-central-1_5nQnV5Oed]
aws_cognito_user_pool_domain.prod: Refreshing state... [id=prod-user-pool]
aws_cognito_user_pool_domain.test: Refreshing state... [id=test-user-pool]
aws_cognito_user_pool.prod: Refreshing state... [id=ca-central-1_bBTSiLgTv]
aws_cognito_user_pool.dev: Refreshing state... [id=ca-central-1_wbP2ihF9p]
aws_cognito_identity_provider.dev-idp1: Refreshing state... [id=ca-central-1_wbP2ihF9p:keycloak-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cognito_user_pool.test has been changed
  ~ resource "aws_cognito_user_pool" "test" {
      + auto_verified_attributes  = []
      + domain                    = "test-user-pool"
        id                        = "ca-central-1_5nQnV5Oed"
        name                      = "test-user-pool"
      + tags                      = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_cognito_identity_provider.dev-idp1 has been changed
  ~ resource "aws_cognito_identity_provider" "dev-idp1" {
        id                = "ca-central-1_wbP2ihF9p:keycloak-dev"
      + idp_identifiers   = []
        # (5 unchanged attributes hidden)
    }
  # aws_cognito_user_pool.dev has been changed
  ~ resource "aws_cognito_user_pool" "dev" {
      + auto_verified_attributes  = []
      + domain                    = "dev-user-pool"
        id                        = "ca-central-1_wbP2ihF9p"
        name                      = "dev-user-pool"
      + tags                      = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # aws_cognito_user_pool.prod has been changed
  ~ resource "aws_cognito_user_pool" "prod" {
      + auto_verified_attributes  = []
      + domain                    = "prod-user-pool"
        id                        = "ca-central-1_bBTSiLgTv"
        name                      = "prod-user-pool"
      + tags                      = {}
        # (7 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cognito_identity_provider.dev-idp1 must be replaced
-/+ resource "aws_cognito_identity_provider" "dev-idp1" {
      ~ id                = "ca-central-1_wbP2ihF9p:keycloak-dev" -> (known after apply)
      - idp_identifiers   = [] -> null
      ~ user_pool_id      = "ca-central-1_wbP2ihF9p" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_cognito_user_pool.dev will be destroyed
  - resource "aws_cognito_user_pool" "dev" {
      - arn                       = "arn:aws:cognito-idp:ca-central-1:220881534007:userpool/ca-central-1_wbP2ihF9p" -> null
      - auto_verified_attributes  = [] -> null
      - creation_date             = "2021-06-14T23:01:24Z" -> null
      - domain                    = "dev-user-pool" -> null
      - endpoint                  = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_wbP2ihF9p" -> null
      - estimated_number_of_users = 0 -> null
      - id                        = "ca-central-1_wbP2ihF9p" -> null
      - last_modified_date        = "2021-06-14T23:01:24Z" -> null
      - mfa_configuration         = "OFF" -> null
      - name                      = "dev-user-pool" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null

      - admin_create_user_config {
          - allow_admin_create_user_only = false -> null
        }

      - email_configuration {
          - email_sending_account = "COGNITO_DEFAULT" -> null
        }

      - password_policy {
          - minimum_length                   = 8 -> null
          - require_lowercase                = true -> null
          - require_numbers                  = true -> null
          - require_symbols                  = true -> null
          - require_uppercase                = true -> null
          - temporary_password_validity_days = 7 -> null
        }

      - verification_message_template {
          - default_email_option = "CONFIRM_WITH_CODE" -> null
        }
    }

  # aws_cognito_user_pool.prod will be destroyed
  - resource "aws_cognito_user_pool" "prod" {
      - arn                       = "arn:aws:cognito-idp:ca-central-1:220881534007:userpool/ca-central-1_bBTSiLgTv" -> null
      - auto_verified_attributes  = [] -> null
      - creation_date             = "2021-06-14T23:01:25Z" -> null
      - domain                    = "prod-user-pool" -> null
      - endpoint                  = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_bBTSiLgTv" -> null
      - estimated_number_of_users = 0 -> null
      - id                        = "ca-central-1_bBTSiLgTv" -> null
      - last_modified_date        = "2021-06-14T23:01:25Z" -> null
      - mfa_configuration         = "OFF" -> null
      - name                      = "prod-user-pool" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null

      - admin_create_user_config {
          - allow_admin_create_user_only = false -> null
        }

      - email_configuration {
          - email_sending_account = "COGNITO_DEFAULT" -> null
        }

      - password_policy {
          - minimum_length                   = 8 -> null
          - require_lowercase                = true -> null
          - require_numbers                  = true -> null
          - require_symbols                  = true -> null
          - require_uppercase                = true -> null
          - temporary_password_validity_days = 7 -> null
        }

      - verification_message_template {
          - default_email_option = "CONFIRM_WITH_CODE" -> null
        }
    }

  # aws_cognito_user_pool.test will be destroyed
  - resource "aws_cognito_user_pool" "test" {
      - arn                       = "arn:aws:cognito-idp:ca-central-1:220881534007:userpool/ca-central-1_5nQnV5Oed" -> null
      - auto_verified_attributes  = [] -> null
      - creation_date             = "2021-06-14T23:01:24Z" -> null
      - domain                    = "test-user-pool" -> null
      - endpoint                  = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_5nQnV5Oed" -> null
      - estimated_number_of_users = 0 -> null
      - id                        = "ca-central-1_5nQnV5Oed" -> null
      - last_modified_date        = "2021-06-14T23:01:24Z" -> null
      - mfa_configuration         = "OFF" -> null
      - name                      = "test-user-pool" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null

      - admin_create_user_config {
          - allow_admin_create_user_only = false -> null
        }

      - email_configuration {
          - email_sending_account = "COGNITO_DEFAULT" -> null
        }

      - password_policy {
          - minimum_length                   = 8 -> null
          - require_lowercase                = true -> null
          - require_numbers                  = true -> null
          - require_symbols                  = true -> null
          - require_uppercase                = true -> null
          - temporary_password_validity_days = 7 -> null
        }

      - verification_message_template {
          - default_email_option = "CONFIRM_WITH_CODE" -> null
        }
    }

  # aws_cognito_user_pool_domain.dev will be destroyed
  - resource "aws_cognito_user_pool_domain" "dev" {
      - aws_account_id              = "220881534007" -> null
      - cloudfront_distribution_arn = "dq9dozspu8y40.cloudfront.net" -> null
      - domain                      = "dev-user-pool" -> null
      - id                          = "dev-user-pool" -> null
      - s3_bucket                   = "aws-cognito-prod-yul-assets" -> null
      - user_pool_id                = "ca-central-1_wbP2ihF9p" -> null
      - version                     = "20210614230125" -> null
    }

  # aws_cognito_user_pool_domain.prod will be destroyed
  - resource "aws_cognito_user_pool_domain" "prod" {
      - aws_account_id              = "220881534007" -> null
      - cloudfront_distribution_arn = "dq9dozspu8y40.cloudfront.net" -> null
      - domain                      = "prod-user-pool" -> null
      - id                          = "prod-user-pool" -> null
      - s3_bucket                   = "aws-cognito-prod-yul-assets" -> null
      - user_pool_id                = "ca-central-1_bBTSiLgTv" -> null
      - version                     = "20210614230125" -> null
    }

  # aws_cognito_user_pool_domain.test will be destroyed
  - resource "aws_cognito_user_pool_domain" "test" {
      - aws_account_id              = "220881534007" -> null
      - cloudfront_distribution_arn = "dq9dozspu8y40.cloudfront.net" -> null
      - domain                      = "test-user-pool" -> null
      - id                          = "test-user-pool" -> null
      - s3_bucket                   = "aws-cognito-prod-yul-assets" -> null
      - user_pool_id                = "ca-central-1_5nQnV5Oed" -> null
      - version                     = "20210614230125" -> null
    }

  # module.user_pool_dev.aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "dev-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "created-by" = "Terraform"
        }
      + tags_all                   = {
          + "created-by" = "Terraform"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + kms_key_id                     = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.user_pool_dev.aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "dev-user-pool"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.user_pool_prod.aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "prod-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "created-by" = "Terraform"
        }
      + tags_all                   = {
          + "created-by" = "Terraform"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + kms_key_id                     = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.user_pool_prod.aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "prod-user-pool"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

  # module.user_pool_test.aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "test-user-pool"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "created-by" = "Terraform"
        }
      + tags_all                   = {
          + "created-by" = "Terraform"
        }

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + lambda_config {
          + create_auth_challenge          = (known after apply)
          + custom_message                 = (known after apply)
          + define_auth_challenge          = (known after apply)
          + kms_key_id                     = (known after apply)
          + post_authentication            = (known after apply)
          + post_confirmation              = (known after apply)
          + pre_authentication             = (known after apply)
          + pre_sign_up                    = (known after apply)
          + pre_token_generation           = (known after apply)
          + user_migration                 = (known after apply)
          + verify_auth_challenge_response = (known after apply)

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.user_pool_test.aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id              = (known after apply)
      + cloudfront_distribution_arn = (known after apply)
      + domain                      = "test-user-pool"
      + id                          = (known after apply)
      + s3_bucket                   = (known after apply)
      + user_pool_id                = (known after apply)
      + version                     = (known after apply)
    }

Plan: 7 to add, 0 to change, 7 to destroy.


------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 0 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junminahn, Action: `pull_request`*